{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js Converter",
  "convertedBy": "Custom Fix",
  "modelTopology": {
    "class_name": "Sequential",
    "config": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 9],
          "dtype": "float32",
          "name": "input_1"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "units": 256,
          "activation": "relu",
          "use_bias": true
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "units": 256,
          "activation": "relu",
          "use_bias": true
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "units": 128,
          "activation": "relu",
          "use_bias": true
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "units": 9,
          "activation": "sigmoid",
          "use_bias": true
        }
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "dense/kernel", "shape": [9, 256], "dtype": "float32"},
        {"name": "dense/bias", "shape": [256], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [256, 256], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [256], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [256, 128], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [128], "dtype": "float32"},
        {"name": "dense_3/kernel", "shape": [128, 9], "dtype": "float32"},
        {"name": "dense_3/bias", "shape": [9], "dtype": "float32"}
      ]
    }
  ]
}